Amiya200/stm32_water_tank/Core/Src/screen.c
    if (countdownActive) {
        uint32_t sec = countdownDuration;
        uint32_t min = sec / 60;
        uint32_t s   = sec % 60;

        snprintf(l0, sizeof(l0), "Time %02d:%02d", (int)min, (int)s);
        snprintf(l1, sizeof(l1), ">Stop     Back");
    }
    else {
        snprintf(l0, sizeof(l0), "Countdown Mode");
        snprintf(l1, sizeof(l1), ">Set      Back");
    }

    lcd_line0(l0);
    lcd_line1(l1);
}



static void show_twist(void){
    char l0[17], l1[17];

    const char* status = twistSettings.twistActive ? "ON " : "OFF";
    snprintf(l0,sizeof(l0),"Tw %s %2ds/%2ds", status,
             (int)twistSettings.onDurationSeconds,
             (int)twistSettings.offDurationSeconds);

    // primary action on SELECT is Enable/Stop; UP/DOWN goes to edit
    snprintf(l1,sizeof(l1),">%s   Edit",
             twistSettings.twistActive ? "Stop" : "Enable");

    lcd_line0(l0);
    lcd_line1(l1);
}


/* ===== Apply functions ===== */
static void apply_search_settings(void){
    searchSettings.testingGapSeconds = edit_search_gap_s;
    searchSettings.dryRunTimeSeconds = edit_search_dry_s;
}

static void apply_twist_settings(void){
    twistSettings.onDurationSeconds = edit_twist_on_s;
    twistSettings.offDurationSeconds = edit_twist_off_s;
}

static void apply_countdown_settings(void){
    // kept for compatibility if other code depends on countdownDuration mirror
    countdownDuration = (uint32_t)edit_countdown_min * 60u;
}

static void enable_semi_auto(void){
    ModelHandle_ClearManualOverride();
    ModelHandle_StartSemiAuto();
    semiAutoEnabled = true;
}
static void disable_semi_auto(void){
    ModelHandle_SetMotor(false);
    semiAutoEnabled = false;
}

static void apply_timer_settings(void)
{
    if (currentSlot >= 5) return;

    timerSlots[currentSlot].enabled = true;
    timerSlots[currentSlot].onHour  = edit_timer_on_h;
    timerSlots[currentSlot].onMinute = edit_timer_on_m;
    timerSlots[currentSlot].offHour  = edit_timer_off_h;
    timerSlots[currentSlot].offMinute = edit_timer_off_m;

    /* 🔥 Immediately re-evaluate timer logic */
    extern void ModelHandle_TimerRecalculateNow(void);
    ModelHandle_TimerRecalculateNow();
}



void Screen_ShowCurrentMode(void)
{
//    extern volatile bool manualActive;
//    extern volatile bool semiAutoActive;
//    extern volatile bool timerActive;
//    extern volatile bool searchActive;
//    extern volatile bool countdownActive;
//    extern volatile bool twistActive;
//
//    /* This function must NEVER allocate heap.
//       Only change logical UI state — let Screen_Update() do rendering. */
//
//    static UiState lastUi = UI_MAX_;
//    UiState newUi;
//
//    // Determine which logical mode is active
//    if (manualActive)        newUi = UI_MANUAL;
//    else if (semiAutoActive) newUi = UI_SEMI_AUTO;
//    else if (timerActive)    newUi = UI_TIMER;
//    else if (searchActive)   newUi = UI_SEARCH;
//    else if (countdownActive)newUi = UI_COUNTDOWN;
//    else if (twistActive)    newUi = UI_TWIST;
//    else                     newUi = UI_DASH;
//
//    // Only switch UI state if mode actually changed
//    if (newUi != lastUi) {
//        ui = newUi;
//        lastUi = newUi;
//        screenNeedsRefresh = true;
//        // no lcd_clear(), no snprintf(), no lcd_send_string()
//    }
}



/* ===== Initialization / Reset ===== */
void Screen_Init(void){
    lcd_init();
    ui = UI_WELCOME;
    last_ui = UI_MAX_;
    screenNeedsRefresh = true;
    lastLcdUpdateTime = HAL_GetTick();
    refreshInactivityTimer();

    edit_search_gap_s = searchSettings.testingGapSeconds;
    edit_search_dry_s = searchSettings.dryRunTimeSeconds;
    edit_twist_on_s   = twistSettings.onDurationSeconds;
    edit_twist_off_s  = twistSettings.offDurationSeconds;
    edit_countdown_min = (uint16_t)(countdownDuration / 60u);
    if (edit_countdown_min == 0) edit_countdown_min = 5; // sane default
}

void Screen_ResetToHome(void){
    ui = UI_WELCOME;
    last_ui = UI_MAX_;
    screenNeedsRefresh = true;
    lastLcdUpdateTime = HAL_GetTick();
    refreshInactivityTimer();
}
/* ============================
   MENU SELECTION LOGIC
   ============================ */
/* ============================
   MENU SELECTION LOGIC
   ============================ */
static void menu_select(void){
    refreshInactivityTimer();

    switch (ui){
        case UI_WELCOME:
            ui = UI_DASH;
            break;

        case UI_DASH:
            ui = UI_MENU;
            goto_menu_top();
            break;

        /* === MENU ITEMS === */
        case UI_MENU:
            switch (menu_idx){
                case 0: ui = UI_MANUAL; break;
                case 1: ui = UI_SEMI_AUTO; break;
                case 2:
                    ui = UI_TIMER;
                    currentSlot = 0;
                    edit_timer_on_h  = timerSlots[currentSlot].onHour;
                    edit_timer_on_m  = timerSlots[currentSlot].onMinute;
                    edit_timer_off_h = timerSlots[currentSlot].offHour;
                    edit_timer_off_m = timerSlots[currentSlot].offMinute;
                    break;
                case 3: ui = UI_SEARCH; break;
                case 4: ui = UI_COUNTDOWN; break;
                case 5: ui = UI_TWIST; break;
                case 6: ui = UI_DASH; break;
                default: ui = UI_DASH; break;
            }
            break;

        /* === MANUAL === */
        case UI_MANUAL:
            ModelHandle_ToggleManual();
            screenNeedsRefresh = true;
            break;

        /* === SEMI AUTO === */
        case UI_SEMI_AUTO:
            if (!semiAutoEnabled) enable_semi_auto();
            else disable_semi_auto();
            ui = UI_DASH;
            break;

        /* === TIMER SLOT EDIT FLOW === */
        case UI_TIMER:
            // Entered only when coming from long press (handled in switches)
            // Short press toggles enable, handled in Screen_HandleButton()
            break;


        case UI_TIMER_SLOT_SELECT:
            ui = UI_TIMER_EDIT_SLOT_ON_H;
            break;

